app/controllers/movies_controller.rb

  def same_director
    movie_director = Movie.select(:director).where(
            'director != :directors_name AND title = :movie_title',
                {
                  directors_name: '',
                  movie_title: params[:title]
                }
          ).first
    @movies = Movie.find_all_by_director movie_director.director unless movie_director == nil
---
SELECT director FROM "movies" WHERE (director != '' AND title = 'Star Wars') LIMIT 1
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'George Lucas'